epidimobife96-rgb/shengyu-xinshi/software/stm32_second_board/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN Private defines */
#define BOARD_LED_Pin GPIO_PIN_13
#define BOARD_LED_GPIO_Port GPIOC
#define BOARD_LED_ON GPIO_PIN_RESET
#define BOARD_LED_OFF GPIO_PIN_SET

#define AMP_MUTE_Pin GPIO_PIN_12
#define AMP_MUTE_GPIO_Port GPIOB
#define AMP_ENABLE GPIO_PIN_RESET
#define AMP_MUTE_ON GPIO_PIN_SET

#define DAC_CS_Pin GPIO_PIN_0
#define DAC_CS_GPIO_Port GPIOB
#define DAC_CS_ACTIVE GPIO_PIN_RESET
#define DAC_CS_INACTIVE GPIO_PIN_SET

#define PGA_CS_Pin GPIO_PIN_6
#define PGA_CS_GPIO_Port GPIOA
#define PGA_CS_ACTIVE GPIO_PIN_RESET
#define PGA_CS_INACTIVE GPIO_PIN_SET

#define POWER_HOLD_Pin GPIO_PIN_1
#define POWER_HOLD_GPIO_Port GPIOC
#define POWER_HOLD_ON GPIO_PIN_SET
#define POWER_HOLD_OFF GPIO_PIN_RESET

#define POWER_KEY_Pin GPIO_PIN_9
#define POWER_KEY_GPIO_Port GPIOB
#define POWER_KEY_PRESSED GPIO_PIN_SET
#define POWER_KEY_RELEASED GPIO_PIN_RESET

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
